In [1]:
#pandas module
#Series means just one sequence of data for ex: one column
import pandas as pd
s=pd.Series()
print(s)

Series([], dtype: float64)

In [6]:
# As series has data(values) as well as index to access that data
s=pd.Series([10,20,30,40,50])
print(s.values)
print(s.index)
print(list(s.index))

[10 20 30 40 50]
RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]

In [7]:
import numpy as np
data=np.array(["Ravi","Sahil","Rahul","Ankit"])
s=pd.Series(data)
print(s)

0     Ravi
1    Sahil
2    Rahul
3    Ankit
dtype: object

In [8]:
#In a series Index can also be defined
#By Default index is 0,1,2,3.....
s=pd.Series(data, index=[100,200,300,400])
print(s)

100     Ravi
200    Sahil
300    Rahul
400    Ankit
dtype: object

In [10]:
print(s[200])

Sahil

In [14]:
s=pd.Series(["Ravi","Sahil","Rahul","Ankit"], index=[100,200,300,400])
print(s[200])

Sahil

In [17]:
#index can be a string also
s=pd.Series(["Ravi","Sahil","Rahul","Ankit"], index=['a','b','c','d'])
print(s['b'])
print(s[1])

Sahil
Sahil

In [18]:
#Slicing the data
print(s[1:])

b    Sahil
c    Rahul
d    Ankit
dtype: object

In [19]:
print(s[1:3])

b    Sahil
c    Rahul
dtype: object

In [20]:
print(s[['a','c','d']])

a     Ravi
c    Rahul
d    Ankit
dtype: object

In [21]:
#adding a data in the series
s=pd.Series(["Ravi","Sahil","Rahul","Ankit"], index=['a','b','c','d'])
s['f']="Mohan"
print(s)

a     Ravi
b    Sahil
c    Rahul
d    Ankit
f    Mohan
dtype: object

In [23]:
new=pd.Series([8,9,10])
s=s.append(new)
print(s)

a     Ravi
b    Sahil
c    Rahul
d    Ankit
f    Mohan
0        8
1        9
2       10
dtype: object

In [24]:
s=s.drop(['d'])
print(s)

a     Ravi
b    Sahil
c    Rahul
f    Mohan
0        8
1        9
2       10
dtype: object

In [25]:
# Data Frame
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [27]:
data=[10,20,30,40]
df=pd.DataFrame(data)
print(df)

    0
0  10
1  20
2  30
3  40

In [29]:
#tabular data
data=[['Ravi',10],['Mohan',20],['Alok',30],['Ankit',40]]
df=pd.DataFrame(data)
print(df)

       0   1
0   Ravi  10
1  Mohan  20
2   Alok  30
3  Ankit  40

In [31]:
#tabular data
data=[['Ravi',10],['Mohan',20],['Alok',30],['Ankit',40]]
df=pd.DataFrame(data,columns=['Name','Marks'])
print(df)

    Name  Marks
0   Ravi     10
1  Mohan     20
2   Alok     30
3  Ankit     40

In [32]:
#Create a Data Frame from Dictionary 
d={'Item':['A','B','C','D','E'],'Price':[600,750,580,300,100]}
df=pd.DataFrame(d)
print(df)

  Item  Price
0    A    600
1    B    750
2    C    580
3    D    300
4    E    100

In [33]:
#accessing the data
print(df['Price'])

0    600
1    750
2    580
3    300
4    100
Name: Price, dtype: int64

In [34]:
print(df['Price'][2])

580

In [35]:
df2=pd.DataFrame([['G',500],['H',400]],columns=['Item','Price'])
print(df2)

  Item  Price
0    G    500
1    H    400

In [37]:
df=df.append(df2)
print(df)

  Item  Price
0    A    600
1    B    750
2    C    580
3    D    300
4    E    100
0    G    500
1    H    400

In [41]:
df.rename(columns={'Item':'Product','Price':'Base_Price'},inplace=True)
print(df)

  Product  Base_Price
0       A         600
1       B         750
2       C         580
3       D         300
4       E         100
0       G         500
1       H         400

In [43]:
#add a new column in data frame
df['Unit']=pd.Series([30,40,20,10,5,12,45])
print(df)

  Product  Base_Price  Unit
0       A         600    30
1       B         750    40
2       C         580    20
3       D         300    10
4       E         100     5
0       G         500    30
1       H         400    40

In [44]:
# Adding a new column using existing column in Data Frame
df['Total_Price']=df['Base_Price']* df['Unit']
print(df)

  Product  Base_Price  Unit  Total_Price
0       A         600    30        18000
1       B         750    40        30000
2       C         580    20        11600
3       D         300    10         3000
4       E         100     5          500
0       G         500    30        15000
1       H         400    40        16000

In [45]:
# Insert a new Column at a particular position
new_data=["Lucknow","Delhi","Delhi","Mumbai","Lucknow","Patna","Mumbai"]
df.insert(2,column="Place",value=new_data)
print(df)

  Product  Base_Price    Place  Unit  Total_Price
0       A         600  Lucknow    30        18000
1       B         750    Delhi    40        30000
2       C         580    Delhi    20        11600
3       D         300   Mumbai    10         3000
4       E         100  Lucknow     5          500
0       G         500    Patna    30        15000
1       H         400   Mumbai    40        16000

In [48]:
a=df.loc[df['Unit']>25]
print(a)

  Product  Base_Price    Place  Unit  Total_Price
0       A         600  Lucknow    30        18000
1       B         750    Delhi    40        30000
0       G         500    Patna    30        15000
1       H         400   Mumbai    40        16000

In [49]:
a=df.loc[df['Place']=="Lucknow"]
print(a)

  Product  Base_Price    Place  Unit  Total_Price
0       A         600  Lucknow    30        18000
4       E         100  Lucknow     5          500

In [50]:
a=df.loc[df['Place'].isin(["Lucknow","Delhi"])]
print(a)

  Product  Base_Price    Place  Unit  Total_Price
0       A         600  Lucknow    30        18000
1       B         750    Delhi    40        30000
2       C         580    Delhi    20        11600
4       E         100  Lucknow     5          500

In [51]:
print(df)

  Product  Base_Price    Place  Unit  Total_Price
0       A         600  Lucknow    30        18000
1       B         750    Delhi    40        30000
2       C         580    Delhi    20        11600
3       D         300   Mumbai    10         3000
4       E         100  Lucknow     5          500
0       G         500    Patna    30        15000
1       H         400   Mumbai    40        16000

In [59]:
#iloc is a function to access data using default index
print(df.iloc[6,4])

16000

In [60]:
#iloc[rowindex,columnindex]
#rowindex=start:end
print(df.iloc[:,4])

0    18000
1    30000
2    11600
3     3000
4      500
0    15000
1    16000
Name: Total_Price, dtype: int64

In [61]:
print(df.iloc[0:3,4])

0    18000
1    30000
2    11600
Name: Total_Price, dtype: int64

In [62]:
print(df.iloc[0:3,1:3])

   Base_Price    Place
0         600  Lucknow
1         750    Delhi
2         580    Delhi

In [63]:
#if start is not provided, it will be taken as 0
print(df.iloc[:3,1:3])

   Base_Price    Place
0         600  Lucknow
1         750    Delhi
2         580    Delhi

In [64]:
#if end is not provided that means till the end of row/column
print(df.iloc[:3,1:])

   Base_Price    Place  Unit  Total_Price
0         600  Lucknow    30        18000
1         750    Delhi    40        30000
2         580    Delhi    20        11600

In [65]:
print(df)

  Product  Base_Price    Place  Unit  Total_Price
0       A         600  Lucknow    30        18000
1       B         750    Delhi    40        30000
2       C         580    Delhi    20        11600
3       D         300   Mumbai    10         3000
4       E         100  Lucknow     5          500
0       G         500    Patna    30        15000
1       H         400   Mumbai    40        16000

In [70]:
#Drop rows with Label 0
df.drop(0,inplace=True)
print(df)

  Product  Base_Price    Place  Unit  Total_Price
1       B         750    Delhi    40        30000
2       C         580    Delhi    20        11600
3       D         300   Mumbai    10         3000
4       E         100  Lucknow     5          500
1       H         400   Mumbai    40        16000

In [71]:
df=pd.read_csv("train.csv")
print(df.head()) #prints first 5 lines from the data frame

    Loan_ID Gender Married Dependents     Education Self_Employed  \
0  LP001002   Male      No          0      Graduate            No
1  LP001003   Male     Yes          1      Graduate            No
2  LP001005   Male     Yes          0      Graduate           Yes
3  LP001006   Male     Yes          0  Not Graduate            No
4  LP001008   Male      No          0      Graduate            No

   ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
0             5849                0.0         NaN             360.0
1             4583             1508.0       128.0             360.0
2             3000                0.0        66.0             360.0
3             2583             2358.0       120.0             360.0
4             6000                0.0       141.0             360.0

   Credit_History Property_Area Loan_Status
0             1.0         Urban           Y
1             1.0         Rural           N
2             1.0         Urban           Y
3             1.0         Urban           Y
4             1.0         Urban           Y

In [72]:
print(df.tail()) # Last 5 Rows of data

      Loan_ID  Gender Married Dependents     Education Self_Employed  \
495  LP002586  Female     Yes          1      Graduate            No
496  LP002587    Male     Yes          0  Not Graduate            No
497  LP002588    Male     Yes          0      Graduate            No
498  LP002600    Male     Yes          1      Graduate           Yes
499  LP002602    Male      No          0      Graduate            No

     ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
495             3326              913.0       105.0              84.0
496             2600             1700.0       107.0             360.0
497             4625             2857.0       111.0              12.0
498             2895                0.0        95.0             360.0
499             6283             4416.0       209.0             360.0

     Credit_History Property_Area Loan_Status
495             1.0     Semiurban           Y
496             1.0         Rural           Y
497             NaN         Urban           Y
498             1.0     Semiurban           Y
499             0.0         Rural           N

In [73]:
df=pd.read_csv("D:\\Big Data Analytics\\BBAU\\train.csv")
print(df.head())

    Loan_ID Gender Married Dependents     Education Self_Employed  \
0  LP001002   Male      No          0      Graduate            No
1  LP001003   Male     Yes          1      Graduate            No
2  LP001005   Male     Yes          0      Graduate           Yes
3  LP001006   Male     Yes          0  Not Graduate            No
4  LP001008   Male      No          0      Graduate            No

   ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
0             5849                0.0         NaN             360.0
1             4583             1508.0       128.0             360.0
2             3000                0.0        66.0             360.0
3             2583             2358.0       120.0             360.0
4             6000                0.0       141.0             360.0

   Credit_History Property_Area Loan_Status
0             1.0         Urban           Y
1             1.0         Rural           N
2             1.0         Urban           Y
3             1.0         Urban           Y
4             1.0         Urban           Y

In [74]:
print(df.columns)

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [75]:
print(df.columns.tolist())

['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education', 'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount', 'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status']

In [77]:
#Missing data or Null data
print(df["Gender"].isnull())

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23      True
24     False
25     False
26     False
27     False
28     False
29     False
       ...
470    False
471    False
472    False
473    False
474    False
475    False
476    False
477     True
478    False
479    False
480    False
481    False
482    False
483    False
484    False
485    False
486    False
487    False
488    False
489    False
490    False
491    False
492    False
493    False
494    False
495    False
496    False
497    False
498    False
499    False
Name: Gender, Length: 500, dtype: bool

In [78]:
#9 data in Gender Column is Null
#Find Null data in a Particular Column
print(df["Gender"].isnull().sum())

9

In [79]:
#Very Important statement for ML Engineer
#To find Null Values in all columns of a dataset
print(df.isnull().sum())

Loan_ID               0
Gender                9
Married               3
Dependents           12
Education             0
Self_Employed        27
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           18
Loan_Amount_Term     14
Credit_History       41
Property_Area         0
Loan_Status           0
dtype: int64

In [80]:
print(df.shape)

(500, 13)

In [83]:
#delete all rows which has null values
df.dropna(inplace=True)

In [84]:
print(df.shape)

(390, 13)

In [85]:
print(df.isnull().sum())

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64